# WRITE  BY JEPTHON
# PLUGIN FOR JepThon 
# @SEMO8L

from telethon import events
import random, re
from ..Config import Config

from jepthon.utils import admin_cmd

import asyncio
from jepthon import jepiq
from random import choice

from ..core.managers import edit_or_reply
from ..sql_helper.globals import gvarstatus

plugin_category = "extra"

Command = Config.COMM_ET or "الاوامر"

rehu = [
    "أكرمك الله بالعَقـل ، فلا تُهين نفسك بأفعَالك...!",
    "اللهّم الجنّة ، وسّلام على الدُنيا و ما فِيها ♥🫀.",
    "اللهُم رضاكٓ فما بعْد رضاك ٓﺇلا الجنه.🌿",
    "الحمدُلله الذي لايُديم ضيقاً إلا وأبدله فرجاً 🤍 🥀",
    "لا باس فهي لم تكن المره الاولي...",
    "اللهّم الجنّة ، وسّلام على الدُنيا و ما فِيها ♥🫀.",
    "اللهُم أجبر قلوبنا كما جبرت قلب سيدنا مُحمد 🖤🥀. ",
]
@jepiq.on(admin_cmd(pattern=f"{Command}(?:\s|$)([\s\S]*)"))
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        lMl10l = random.choice(rehu)
        await event.edit(
        f": **⊷╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](t.me/FTTUTY) •✬•╾╾⊶**\n\n( `.م1` )  ↢ **✰︎ اوامر الادمن**\n( `.م2` )  ↢ **✰︎ اوامر المجموعة**\n( `.م3` )  ↢ **✰︎ اوامر الترحيب والردود**\n( `.م4` )  ↢ **✰︎ حماية خاص والتلكراف**\n( `.م5` )  ↢ **✰︎ اوامر المنشن والانتحال**\n( `.م6` )  ↢ **✰︎ اوامر التحميل والترجمة**\n( `.م7` )  ↢ **✰︎ اوامر المنع و القفل**\n( `.م8` )  ↢ **✰︎ اوامر التنظيف والتكرار**\n( `.م9` )  ↢ **✰︎ اوامر التخصيص والفارات**\n( `.م10` ) ⦙ **✰︎ اوامر الوقتي و التشغيل**\n( `.م11` ) ↢ **✰︎ اوامر الكشف و الروابط**\n( `.م12` ) ↢ **✰︎ اوامر المساعدة والإذاعة** \n( `.م13` ) ↢ **✰︎ اوامر الارسال والاذكار**\n( `.م14` ) ↢ **اوامر المـلصقات وكوكل**\n( `.م15` ) ↢ **✰︎ اوامر التسلية والميمز والتحشيش** \n( `.م16` ) ↢ **✰︎ اوامر الصيغ والجهات**\n( `.م17` ) ↢ **✰︎ اوامر التمبلر والزغرفة والمتحركة**\n( `.م18` ) ↢ **✰︎ اوامر الحساب والترفيه**\n( `.م19` ) ↢ **✰︎ اوامر الميوزك والتشغيل**\n( `.م20` ) ↢ **✰︎ اوامر بصمات الميمز**\n**✰︎ ↢ الـمبـرمـجہ : @DEV_SAMIR 🕷**\n**⊷╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](t.me/FTTUTY) •✬•╾╾⊶** \n **᯽︙ {lMl10l} **"
)

@jepiq.ar_cmd(
    pattern="م1$",
    command=("م1", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قـائـمـة اوامـر الادمـن لـسـورس سـيـمـو **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحظر` )\n- ( `.اوامر الكتم` )\n- ( `.اوامر التثبيت` )\n- ( `.اوامر الاشراف` )\n╼╼╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾╾╾︙"
)
		
@jepiq.ar_cmd(
    pattern="م2$",
    command=("م2", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"**قـائـمـة اوامـر الـمـجـمـوعـهہ لـسـورس سـيـمـو **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التفليش` )\n- ( `.اوامر المحذوفين` )\n- ( `.اوامر الكروب` )\n ︙╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ :"
)

@jepiq.ar_cmd(
    pattern="م3$",
    command=("م3", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قـائـمـة اوامـر الـتـرحـيـب والـردود **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترحيب` )\n- ( `.اوامر الردود` )\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ ︙"
)
@jepiq.ar_cmd(
    pattern="م4$",
    command=("م4", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر حـماية الخاص والتلكراف **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الحماية` )\n- ( `.اوامر التلكراف` ) \n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ : "
)
@jepiq.ar_cmd(
    pattern="م5$",
    command=("م5", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الـمنشن والانتحال **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L) •✬•╾╾\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الانتحال` )\n- ( `.اوامر التقليد` )\n- ( `.اوامر المنشن` ) \n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)

@jepiq.ar_cmd(
    pattern="م6$",
    command=("م6", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التحميل والترجمه **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر النطق` )\n- ( `.اوامر التحميل` )\n- ( `.اوامر الترجمة` ) \n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)

@jepiq.ar_cmd(
    pattern="م7$",
    command=("م7", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر القفل والمنع **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر القفل` )\n- ( `.اوامر الفتح` )\n- ( `.اوامر المنع` ) \n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)

@jepiq.ar_cmd(
    pattern="م8$",
    command=("م8", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التكرار والتنظيف **:\n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التكرار` )\n- ( `.اوامر السبام` )\n- ( `.اوامر التنظيف` ) \n- ( `.اوامر المسح` ) \n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)

@jepiq.ar_cmd(
    pattern="م9$",
    command=("م9", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة التخصيص والفارات **:\n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التخصيص` )\n لتغير الصور والكلايش كل من الحماية والفحص والبنك\n- ( `.اوامر الفارات` )\n - لتغير الاسم وزخرفة الوقت والصورة الوقتية والمنطقة الزمنية ورمز الاسم والبايو الوقتي وغيرها\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
		)

@jepiq.ar_cmd(
    pattern="م10$",
    command=("م10", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الوقتي والتشغيل **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الاسم` )\n- ( `.اوامر البايو` )\n- ( `.اوامر الكروب الوقتي` )\n- ( `.اوامر التشغيل` ) \n- ( `.اوامر الاطفاء` ) \n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)	

@jepiq.ar_cmd(
    pattern="م11$",
    command=("م11", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الكـشف و الروابط **:\n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الكشف` )\n- ( `.اوامر الروابط` ) \n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)
@jepiq.ar_cmd(
    pattern="م12$",
    command=("م12", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر المساعدة  **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ \n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الوقت والتاريخ` )\n- ( `.اوامر كورونا` )\n- ( `.اوامر الصلاة` ) \n- ( `.اوامر مساعدة` )\n- ( `.اوامر الاذاعه` ) \n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)
@jepiq.ar_cmd(
    pattern="م13$",
    command=("م13", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الارسال **:\n╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.امر الصورة الذاتية` )\n- ( `.اوامر التحذيرات` )\n- ( `.اوامر اللستة` )\n- ( `.اوامر الملكية` ) \n- ( `.اوامر السليب` ) \n- ( `.اوامر الاذكار` )\n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)
@jepiq.ar_cmd(
    pattern="م14$",
    command=("م14", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الملصقات وكوكل **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الملصقات` )\n- ( `.اوامر كوكل` )\n ╼╼•✬[  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾ ︙"
)

@jepiq.ar_cmd(
    pattern="م15$",
    command=("م15", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر التسلية والتحشيش **:\n ╼╼•✬[  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التسلية` )\n- ( `.اوامر التحشيش` )\n- ( `.اوامر الميمز` )\n ╼╼•✬[  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)

@jepiq.ar_cmd(
    pattern="م16$",
    command=("م16", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر تحويل الصيغ و الجهات **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر التحويل` )\n- ( `.اوامر الجهات` ) \n ╼╼•✬[  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"
)

@jepiq.ar_cmd(
    pattern="م18$",
    command=("م18", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر الحساب و الترفيه **:\n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.اوامر الترفيه` )\n- ( `.اوامر الحساب` ) \n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"

)

@jepiq.ar_cmd(
    pattern="م19",
    command=("م19", plugin_category),
)
async def _(event):
     if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
        await event.edit(
        " قائمة اوامر الميوزك والتشغيل 🎵**:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙\n᯽︙ اختر احدى هذه الاوامر\n ᯽︙ قبل أستخدام هذه الاوامر يجب تفعيل المود بكتابة ألامر ( `.ميوزك تفعيل` ) \n- ( `.تشغيل_المكالمة` )\n- لتشغيل المحادثة الصوتيه\n- ( `.انهاء_المكالمة` )\n-لأنهاء المحادثه الصوتية \n- ( `.دعوة` )\n- بالرد على الشخص لدعوته الى المكالمة \n- ( `.معلومات_المكالمة` )\n- لعرض عنوان المكالمة وعدد لاشخاص الموجودين فيها \n- ( `.تسمية_المكالمة` )\n- لتغير عنوان المكالمة \n- ( `.انضمام` )\n- للأنضمام الى المحادثة الصوتية\n- ( `.مغادرة` )\n- لمغادرة المحادثة الصوتية \n- ( `.تشغيل` )\n-بالرد على رابط اليوتيوب او كتابة الامر مع رابط ليوتيوب لتشغيل الاغنيه \n- ( `.قائمة_التشغيل` )\n- لعرض قائمة التشغيل \n- ( `.ايقاف_مؤقت` )\n - لأيقاف الاغنية الحالية مؤقتا \n- ( `.استمرار` )\n -لأستمرار الاغنيه التي تم ايقافها \n- ( `.تخطي` )\n- لتخطي الاغنيه وتشغيل الاغنيه الموجوده في قائمة التشغيل \n\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"



)

@jepiq.ar_cmd(
    pattern="م20$",
    command=("م20", plugin_category),
)
async def _(event):
	if not event.text[0].isalpha() and event.text[0] not in ("/", "#", "@", "!"):
		await event.edit(
		"** قائمة اوامر بصمات الميمز **:\n ╼╼•✬•  [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙\n ᯽︙ اختر احدى هذه القوائم\n\n- ( `.بصمات ميمز` )\n- ( `.بصمات ميمز2` )\n- ( `.بصمات ميمز3` )\n- ( `.بصمات ميمز4` )\n- ( `.بصمات ميمز5` )\n- ( `.بصمات انمي` ) \n ╼╼•✬• [𝐒𝐎𝐔𝐑𝐂𝐄 𝐒𝐄𝐌𝐎](https://t.me/SEMO8L)  •✬•╾╾︙"

)
